<?php
// +----------------------------------------------------------------------
// | HeilPHP 
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://www.heilphp.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: Jason <1878566968@qq.com>
// +----------------------------------------------------------------------

// [ 应用入口文件 ]

//检测php版本
if(version_compare(PHP_VERSION,'5.4.0','<'))  die('require PHP > 5.4.0 !');

/**
 * 系统调试设置
 * 项目正式部署后请设置为false
 */
define ( 'BIND_MODULE','install');

/**
 * 应用目录设置
 * 安全起见，建议安装调试完成后移动到非WEB目录
 */
define('APP_PATH', __DIR__ . '/../app/');

// 加载框架引导文件
require __DIR__ . '/../thinkphp/start.php';
